<a href="https://colab.research.google.com/github/silverstar0727/1day-1commit-challenge/blob/master/pandas_day9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas day9

## 1day 1commit 열일중..

In [3]:
# day1의 데이터를 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

dates = pd.date_range('20100101', periods = 5)
df = pd.DataFrame(np.random.randn(5,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2010-01-01 -0.056351 -0.650308  0.433791  0.205432
2010-01-02  0.020254 -0.585636  1.231737 -1.962158
2010-01-03 -0.212367  0.819590 -2.174279  1.259223
2010-01-04  0.728086 -2.518040  0.490050  0.787754
2010-01-05 -0.762146  1.527154 -0.060121  0.140825

# pd.melt()

In [5]:
df = pd.melt(df)
df

   variable     value
0         A -0.056351
1         A  0.020254
2         A -0.212367
3         A  0.728086
4         A -0.762146
5         B -0.650308
6         B -0.585636
7         B  0.819590
8         B -2.518040
9         B  1.527154
10        C  0.433791
11        C  1.231737
12        C -2.174279
13        C  0.490050
14        C -0.060121
15        D  0.205432
16        D -1.962158
17        D  1.259223
18        D  0.787754
19        D  0.140825

# pd.pivot() 
>melt의 역과정이라고 보면됨

In [7]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [8]:
df1.pivot("도시", "연도", "인구")

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0